{
  "ir_version": "1.0",
  "project": "structured-evaluation",
  "repository": "https://github.com/agentplexus/structured-evaluation",
  "versioning": "semver",
  "commit_convention": "conventional",
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-01-26",
      "highlights": [
        { "description": "Rubric definitions with score anchors for consistent LLM-as-Judge evaluations" },
        { "description": "Judge metadata tracking (model, prompt, temperature, tokens)" },
        { "description": "Pairwise comparison mode as alternative to absolute scoring" },
        { "description": "Multi-judge aggregation with agreement metrics" }
      ],
      "added": [
        { "description": "Rubric and ScoreAnchor types for defining explicit scoring criteria", "commit": "ba83b8d" },
        { "description": "Range-based score anchors (e.g., 8-10 = Excellent)", "commit": "ba83b8d" },
        { "description": "DefaultPRDRubricSet with problem_definition, solution_clarity, success_metrics", "commit": "ba83b8d" },
        { "description": "JudgeMetadata type for tracking LLM model, provider, and prompt", "commit": "4874b1d" },
        { "description": "TokenUsage tracking for evaluation cost monitoring", "commit": "4874b1d" },
        { "description": "Observability trace/span links in JudgeMetadata", "commit": "4874b1d" },
        { "description": "PairwiseComparison type for comparing two outputs", "commit": "4ec495d" },
        { "description": "Position bias detection via swapped comparisons", "commit": "4ec495d" },
        { "description": "ComputePairwiseResult for aggregating comparison results", "commit": "4ec495d" },
        { "description": "ReferenceData and ReferenceDataset types for gold/expected data", "commit": "5c937e9" },
        { "description": "Human annotation support with scores and labels", "commit": "5c937e9" },
        { "description": "MultiJudgeResult for aggregating evaluations from multiple judges", "commit": "06060ac" },
        { "description": "Aggregation methods: mean, median, weighted, majority, conservative", "commit": "06060ac" },
        { "description": "Inter-judge agreement metrics and disagreement detection", "commit": "06060ac" },
        { "description": "Finding consolidation with severity-based deduplication", "commit": "06060ac" },
        { "description": "Judge, RubricID, and Reference fields in EvaluationReport", "commit": "3cb047c" }
      ],
      "changed": [
        { "description": "Updated JSON Schema to include v0.2.0 types", "commit": "62ca52b" }
      ],
      "tests": [
        { "description": "Unit tests for Rubric, PairwiseComparison, and MultiJudgeResult", "commit": "682e87b" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-26",
      "highlights": [
        { "description": "Reusable evaluation framework for LLM-as-Judge and multi-agent workflows" },
        { "description": "InfoSec severity levels (Critical, High, Medium, Low) with configurable pass criteria" },
        { "description": "DAG-based report aggregation for multi-agent coordination" }
      ],
      "added": [
        { "description": "`evaluation` package with EvaluationReport, CategoryScore, Finding, Severity types", "commit": "7a283de" },
        { "description": "Category scoring with weighted scores (0-10) and pass/warn/fail status", "commit": "0981fed" },
        { "description": "PassCriteria and Decision types with configurable approval thresholds", "commit": "f32acc9" },
        { "description": "EvaluationReport with metadata, categories, findings, and next steps", "commit": "f11ae66" },
        { "description": "`summary` package with SummaryReport, TeamSection, TaskResult for GO/NO-GO checks", "commit": "897e09b" },
        { "description": "`combine` package with DAG-based topological sort using Kahn's algorithm", "commit": "5b384b7" },
        { "description": "AggregateResults and AggregateWithDAG for multi-agent coordination", "commit": "5b384b7" },
        { "description": "Box-format terminal renderer for summary reports", "commit": "1ea0b48" },
        { "description": "Detailed terminal renderer for evaluation reports with severity grouping", "commit": "1ea0b48" },
        { "description": "JSON Schema generation using invopop/jsonschema", "commit": "2f77e28" },
        { "description": "Embedded schemas via `//go:embed` for runtime access", "commit": "2f77e28" },
        { "description": "`sevaluation` CLI with render, check, validate, and schema commands", "commit": "bfdb7bf" }
      ],
      "tests": [
        { "description": "Unit tests for evaluation criteria, DAG sorting, and summary reports", "commit": "95435a5" }
      ],
      "documentation": [
        { "description": "Example evaluation and summary reports in examples/", "commit": "b014b5f" }
      ],
      "build": [
        { "description": "GitHub Actions workflows for CI, linting, and CodeQL analysis", "commit": "7ea98ec" },
        { "description": "Dependabot configuration for automated dependency updates", "commit": "7ea98ec" },
        { "description": "golangci-lint configuration", "commit": "57e6570" }
      ]
    }
  ]
}
